fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>ВКМ_Сотрудник</name>
    <type><types>CatalogRef.Пользователи</types></type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type><types>Date</types><dateQualifiers><dateFractions>Date</dateFractions></dateQualifiers></type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type><types>Date</types><dateQualifiers><dateFractions>Date</dateFractions></dateQualifiers></type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type><types>String</types><stringQualifiers><length>200</length></stringQualifiers></type>
  </attributes>
  <attributes>
    <name>ВКМ_Год</name>
    <type><types>Date</types><dateQualifiers><dateFractions>Date</dateFractions></dateQualifiers></type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type><types>CatalogRef.Пользователи</types></type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type><types>Date</types><dateQualifiers><dateFractions>Date</dateFractions></dateQualifiers></type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type><types>Date</types><dateQualifiers><dateFractions>Date</dateFractions></dateQualifiers></type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(Объект.ВКМ_Год) Тогда
		Объект.ВКМ_Год = НачалоГода(ТекущаяДатаСеанса());
	КонецЕсли;

	ВКМ_ОбновитьПодсветкуПревышенияНормы();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ВКМ_ОбновитьПодсветкуПревышенияНормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковПриИзменении(Элемент)

	ВКМ_ОбновитьПодсветкуПревышенияНормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_АнализГрафика(Команда)

	АдресДанных = ВКМ_ПоместитьДанныеГрафикаВоВременноеХранилище();
	ПараметрыФормы = Новый Структура("АдресДанныхГрафика", АдресДанных);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ОбновитьПодсветкуПревышенияНормы()

	ДниПоСотрудникам = Новый Соответствие;
	Для Каждого СтрокаОтпуска Из Объект.ВКМ_ОтпускаСотрудников Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаОтпуска.ВКМ_Сотрудник)
			Или НЕ ЗначениеЗаполнено(СтрокаОтпуска.ВКМ_ДатаНачала)
			Или НЕ ЗначениеЗаполнено(СтрокаОтпуска.ВКМ_ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;

		Дней = (НачалоДня(СтрокаОтпуска.ВКМ_ДатаОкончания) - НачалоДня(СтрокаОтпуска.ВКМ_ДатаНачала)) / 86400 + 1;
		ТекущиеДни = ДниПоСотрудникам.Получить(СтрокаОтпуска.ВКМ_Сотрудник);
		Если ТекущиеДни = Неопределено Тогда
			ТекущиеДни = 0;
		КонецЕсли;
		ДниПоСотрудникам.Вставить(СтрокаОтпуска.ВКМ_Сотрудник, ТекущиеДни + Дней);
	КонецЦикла;

	УсловноеОформление.Элементы.Очистить();
	Для Каждого КлючИЗначение Из ДниПоСотрудникам Цикл
		Если КлючИЗначение.Значение <= 28 Тогда
			Продолжить;
		КонецЕсли;

		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);

		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ВКМ_ОтпускаСотрудников");

		ОтборОформления = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборОформления.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВКМ_ОтпускаСотрудников.ВКМ_Сотрудник");
		ОтборОформления.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборОформления.ПравоеЗначение = КлючИЗначение.Ключ;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ВКМ_ПоместитьДанныеГрафикаВоВременноеХранилище()

	ТаблицаОтпусков = Объект.ВКМ_ОтпускаСотрудников.Выгрузить();
	ДанныеГрафика = Новый Структура("Год, Отпуска", Объект.ВКМ_Год, ТаблицаОтпусков);
	Возврат ПоместитьВоВременноеХранилище(ДанныеГрафика, УникальныйИдентификатор);

КонецФункции

#КонецОбласти
